{"config": [{"config": {"input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_1", "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 5, "nb_row": 5, "init": "glorot_uniform", "activation": "relu", "trainable": true, "b_constraint": null, "name": "convolution2d_1", "dim_ordering": "tf", "subsample": [2, 2], "bias": true, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_filter": 24}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"nb_col": 5, "nb_row": 5, "init": "glorot_uniform", "activation": "relu", "trainable": true, "b_constraint": null, "name": "convolution2d_2", "dim_ordering": "tf", "subsample": [2, 2], "bias": true, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_filter": 36}, "class_name": "Convolution2D"}, {"config": {"nb_col": 5, "nb_row": 5, "init": "glorot_uniform", "activation": "relu", "trainable": true, "b_constraint": null, "name": "convolution2d_3", "dim_ordering": "tf", "subsample": [2, 2], "bias": true, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_filter": 48}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "trainable": true, "b_constraint": null, "name": "convolution2d_4", "dim_ordering": "tf", "subsample": [1, 1], "bias": true, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "trainable": true, "b_constraint": null, "name": "convolution2d_5", "dim_ordering": "tf", "subsample": [1, 1], "bias": true, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "activation": "relu", "b_constraint": null, "name": "dense_1", "trainable": true, "input_dim": 2496, "bias": true, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "output_dim": 100}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "activation": "relu", "b_constraint": null, "name": "dense_2", "trainable": true, "input_dim": 100, "bias": true, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "output_dim": 50}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "activation": "relu", "b_constraint": null, "name": "dense_3", "trainable": true, "input_dim": 50, "bias": true, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "output_dim": 10}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "activation": "linear", "b_constraint": null, "name": "dense_4", "trainable": true, "input_dim": 10, "bias": true, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}