{"keras_version": "1.2.0", "config": [{"config": {"trainable": true, "batch_input_shape": [null, 160, 320, 3], "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2], "input_dtype": "float32", "dim_ordering": "tf", "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"W_regularizer": null, "nb_filter": 24, "subsample": [2, 2], "nb_col": 5, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "bias": true, "activation": "relu", "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "b_regularizer": null, "nb_row": 5, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "strides": [1, 1], "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "nb_filter": 36, "subsample": [2, 2], "nb_col": 5, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "bias": true, "activation": "relu", "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "b_regularizer": null, "nb_row": 5, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"W_regularizer": null, "nb_filter": 48, "subsample": [2, 2], "nb_col": 5, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "bias": true, "activation": "relu", "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "b_regularizer": null, "nb_row": 5, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "strides": [1, 1], "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "nb_filter": 64, "subsample": [1, 1], "nb_col": 3, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "bias": true, "activation": "relu", "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "b_regularizer": null, "nb_row": 3, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"W_regularizer": null, "nb_filter": 64, "subsample": [1, 1], "nb_col": 3, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "bias": true, "activation": "relu", "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "b_regularizer": null, "nb_row": 3, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "strides": [1, 1], "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "activation": "relu", "b_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_1", "activity_regularizer": null, "bias": true, "input_dim": 704, "trainable": true, "init": "glorot_uniform", "output_dim": 100}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "activation": "relu", "b_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_2", "activity_regularizer": null, "bias": true, "input_dim": 100, "trainable": true, "init": "glorot_uniform", "output_dim": 50}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "activation": "relu", "b_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_3", "activity_regularizer": null, "bias": true, "input_dim": 50, "trainable": true, "init": "glorot_uniform", "output_dim": 10}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "activation": "linear", "b_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_4", "activity_regularizer": null, "bias": true, "input_dim": 10, "trainable": true, "init": "glorot_uniform", "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential"}