{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "pool_size": [2, 2], "batch_input_shape": [null, 160, 320, 3], "trainable": true, "border_mode": "valid", "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activity_regularizer": null, "b_constraint": null, "nb_row": 5, "bias": true, "init": "glorot_uniform", "trainable": true, "activation": "relu", "name": "convolution2d_1", "b_regularizer": null, "subsample": [2, 2], "nb_col": 5, "border_mode": "valid", "nb_filter": 24, "W_constraint": null, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "dim_ordering": "tf", "name": "maxpooling2d_2", "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activity_regularizer": null, "b_constraint": null, "nb_row": 5, "bias": true, "init": "glorot_uniform", "trainable": true, "activation": "relu", "name": "convolution2d_2", "b_regularizer": null, "subsample": [2, 2], "nb_col": 5, "border_mode": "valid", "nb_filter": 36, "W_constraint": null, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activity_regularizer": null, "b_constraint": null, "nb_row": 5, "bias": true, "init": "glorot_uniform", "trainable": true, "activation": "relu", "name": "convolution2d_3", "b_regularizer": null, "subsample": [2, 2], "nb_col": 5, "border_mode": "valid", "nb_filter": 48, "W_constraint": null, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "dim_ordering": "tf", "name": "maxpooling2d_3", "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activity_regularizer": null, "b_constraint": null, "nb_row": 3, "bias": true, "init": "glorot_uniform", "trainable": true, "activation": "relu", "name": "convolution2d_4", "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "border_mode": "valid", "nb_filter": 64, "W_constraint": null, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activity_regularizer": null, "b_constraint": null, "nb_row": 3, "bias": true, "init": "glorot_uniform", "trainable": true, "activation": "relu", "name": "convolution2d_5", "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "border_mode": "valid", "nb_filter": 64, "W_constraint": null, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "dim_ordering": "tf", "name": "maxpooling2d_4", "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "activation": "relu", "name": "dense_1", "output_dim": 100, "input_dim": 704, "b_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "activation": "relu", "name": "dense_2", "output_dim": 50, "input_dim": 100, "b_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "activation": "relu", "name": "dense_3", "output_dim": 10, "input_dim": 50, "b_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "activation": "linear", "name": "dense_4", "output_dim": 1, "input_dim": 10, "b_regularizer": null}}]}